Зачастую при выводе комплексного компонента каталог в настройках нет галочки, показывать все элементы, если не указан раздел. Чтобы она появилась нужно вставить данные ключи в вызов комплексного компонента каталог.

"SHOW_ALL_WO_SECTION" => "Y",
"HIDE_NOT_AVAILABLE" => "N",
"SEF_MODE" => "N",
"USE_MAIN_ELEMENT_SECTION" => "N",

<!-- // -->

Данный ключ поможет включить раздел в цепочку навигации, в комплексном компоненте каталог.

"ADD_SECTIONS_CHAIN" => "Y",

<!-- // -->

Данный ключ выводит название элемента в цепочки навигации в catalog.element

"ADD_ELEMENT_CHAIN" => "Y",

<!-- // -->

Данный ключ выводит название раздела в цепочки навигации в catalog.element

"ADD_SECTIONS_CHAIN" => "Y",
